{
    "nodes": [
        {
            "id": "1",
            "type": "dictionaryNode",
            "data": {
                "title": "Веб-сайт", 
                "description": "Коллекция страниц, связанных между собой какими-либо способами (включая их связи с иными ресурсами), которые доступны под единым доменным именем. Каждая страница сайта содержит прямые ссылки (практически всегда выделенные части текста, по которым можно кликнуть мышью), что позволяет пользователю быстро переходить от одной страницы веб-сайта к другой." 
            },
            "position": { 
                "x": 0, 
                "y": 0
             }
        },
        {
            "id": "2",
            "type": "dictionaryNode",
            "data": {
                "title": "Веб-страница", 
                "description": "Документ, который может быть отображён веб-браузерами, такими как: Firefox, Google Chrome, Microsoft Internet Explorer / Edge " 
            },
            "position": { 
                "x": -150, 
                "y": 100
             }
        },
        {
            "id": "3",
            "type": "dictionaryNode",
            "data": {
                "title": "Веб-сервер", 
                "description": "Компьютер, предоставляющий в сеть один или множество веб-сайтов (хостинг). Понятие хостинг - означает, что все страницы и прикреплённые к ним файлы содержатся на данном компьютере. Т.е. Веб-сервер будет отправлять любую страницу с сайта по запросу любого пользователя, что и будет хостингом для браузера пользователя." 
            },
            "position": { 
                "x": 100, 
                "y": 100
             }
        },
        {
            "id": "4",
            "type": "dictionaryNode",
            "data": {
                "title": "IP-адрес", 
                "description": "Уникальный числовой идентификатор устройства в компьютерной сети, работающей по протоколу IP." 
            },
            "position": { 
                "x": 200, 
                "y": 200
             }
        },
        {
            "id": "5",
            "type": "dictionaryNode",
            "data": {
                "title": "Домен", 
                "description": "Уникальное название сайта или другого ресурса в Сети. Именно доменное имя люди печатают в адресной строке браузера, чтобы открыть конкретный интернет-портал или страницу." 
            },
            "position": { 
                "x": -50, 
                "y": 300
             }
        },
        {
            "id": "6",
            "type": "dictionaryNode",
            "data": {
                "title": "DNS", 
                "description": "Иерархическая децентрализованная система именования для интернет-ресурсов подключённых к Интернет, которая ведёт список доменных имён вместе с их числовыми IP-адресами или местонахождениями." 
            },
            "position": { 
                "x": 200, 
                "y": 0
             }
        },
        {
            "id": "7",
            "type": "dictionaryNode",
            "data": {
                "title": "HTTP", 
                "description": "Протокол, позволяющий получать различные ресурсы, например HTML-документы. Протокол HTTP лежит в основе обмена данными в Интернете. HTTP является протоколом клиент-серверного взаимодействия, что означает инициирование запросов к серверу самим получателем, обычно веб-браузером (web-browser)." 
            },
            "position": { 
                "x": 100, 
                "y": 300
             }
        },
        {
            "id": "8",
            "type": "dictionaryNode",
            "data": {
                "title": "HTTPS", 
                "description": "Расширение протокола HTTP для поддержки шифрования в целях повышения безопасности. Данные в протоколе HTTPS передаются поверх криптографических протоколов TLS или устаревшего в 2015 году SSL." 
            },
            "position": { 
                "x": 50, 
                "y": 400
             }
        },
        {
            "id": "9",
            "type": "dictionaryNode",
            "data": {
                "title": "HTML", 
                "description": "Стандартизированный язык гипертекстовой разметки документов для просмотра веб-страниц в браузере. Веб-браузеры получают HTML документ от сервера по протоколам HTTP/HTTPS или открывают с локального диска, далее интерпретируют код в интерфейс, который будет отображаться на экране монитора." 
            },
            "position": { 
                "x": -250, 
                "y": 200
             }
        },
        {
            "id": "10",
            "type": "dictionaryNode",
            "data": {
                "title": "CSS", 
                "description": "Формальный язык декорирования и описания внешнего вида документа (веб-страницы), написанного с использованием языка разметки (чаще всего HTML или XHTML). Также может применяться к любым XML-документам, например, к SVG или XUL." 
            },
            "position": { 
                "x": -200, 
                "y": 300
             }
        },
        {
            "id": "11",
            "type": "dictionaryNode",
            "data": {
                "title": "JS cкрипт", 
                "description": "Скрипт на язык программирования JavaScript, позволяющий создавать динамически обновляемый контент, управлять мультимедиа, анимировать изображения и делать многое другое." 
            },
            "position": { 
                "x": -100, 
                "y": 200
             }
        },
        {
            "id": "12",
            "type": "dictionaryNode",
            "data": {
                "title": "URL", 
                "description": "Cтрока, однозначно определяющая, где в интернете находится ресурс. В контексте HTTP, URL называют \"адрес\" (web address)\" или \"ссылку\" (link)." 
            },
            "position": { 
                "x": 50, 
                "y": 200
             }
        }
    ],
    "edges": [
        {
            "id": "1-2",
            "source": "1",
            "target": "2",
            "label": "содержит 1 или несколько"
        },
        {
            "id": "1-3",
            "source": "1",
            "target": "3",
            "label": "расположен на"
        },
        {
            "id": "3-4",
            "source": "3",
            "target": "4",
            "label": "доступен по"
        },
        {
            "id": "2-9",
            "source": "2",
            "target": "9",
            "label": "содержит"
        },
        {
            "id": "2-10",
            "source": "2",
            "target": "10",
            "label": "содержит"
        },
        {
            "id": "2-11",
            "source": "2",
            "target": "11",
            "label": "содержит"
        },
        {
            "id": "1-12",
            "source": "1",
            "target": "12",
            "label": "доступен по"
        },
        {
            "id": "12-5",
            "source": "12",
            "target": "5",
            "label": "состоит из"
        },
        {
            "id": "12-7",
            "source": "12",
            "target": "7",
            "label": "состоит из"
        },
        {
            "id": "7-8",
            "source": "7",
            "target": "8",
            "label": "является основой"
        },
        {
            "id": "6-4",
            "source": "6",
            "target": "4",
            "label": "сопоставляет"
        }
    ]
}