{
    "nodes": [
        {
            "id": "1",
            "type": "dictionaryNode",
            "data": {
                "title": "Веб-приложение",
                "description": "Программное обеспечение, разработанное для выполнения определенных задач или предоставления определенных услуг через интернет. Оно доступно через веб-браузер и может предлагать широкий спектр функциональности, включая обработку данных, взаимодействие с пользователями, передачу информации и многое другое."
            },
            "position": {
                "x": 0,
                "y": 0
             }
        },
        {
            "id": "2",
            "type": "dictionaryNode",
            "data": {
                "title": "Веб-страница",
                "description": "Документ, который может быть отображён веб-браузерами, такими как: Firefox, Google Chrome, Microsoft Internet Explorer / Edge "
            },
            "position": {
                "x": -200,
                "y": 100
             }
        },
        {
            "id": "3",
            "type": "dictionaryNode",
            "data": {
                "title": "DOM",
                "description": "(Document Object Model) представляет собой программный интерфейс, который представляет структуру и содержимое веб-документа в виде дерева объектов, доступного для изменения с использованием различных языков программирования, таких как JavaScript. DOM предоставляет стандартизированный способ представления и взаимодействия с элементами HTML, XML и XHTML, что позволяет динамически изменять содержимое, стили и структуру веб-страницы или веб-приложения."
            },
            "position": {
                "x": 200,
                "y": 400
             }
        },
        {
            "id": "4",
            "type": "dictionaryNode",
            "data": {
                "title": "Рендеринг",
                "description": "Процесс создания финального изображения или последовательности из изображений на основе двухмерных или трехмерных данных. Данный процесс происходит с использованием компьютерных программ и зачастую сопровождается трудными техническими вычислениями, которые ложатся на вычислительные мощности компьютера или на отдельные его комплектующие части."
            },
            "position": {
                "x": 200,
                "y": 250
             }
        },
        {
            "id": "5",
            "type": "dictionaryNode",
            "data": {
                "title": "Компонент",
                "description": "Повторно используемый строительный блок для создания пользовательского интерфейса. Компоненты позволяют разбить интерфейс на независимые части и управлять каждой частью отдельно. Они могут быть как простыми элементами, так и более сложными, состоящими из других компонентов."
            },
            "position": {
                "x": -50,
                "y": 200
             }
        },
        {
            "id": "6",
            "type": "dictionaryNode",
            "data": {
                "title": "Веб-фреймворк",
                "description": "Комплекс инструментов, библиотек и шаблонов, предназначенных для упрощения разработки веб-приложений. Он предоставляет структуру и набор готовых компонентов, которые упрощают создание, развертывание и поддержку веб-приложений. Веб-фреймворк включает общие решения для задач, таких как маршрутизация, управление состоянием, взаимодействие с базой данных, авторизация пользователей и другие аспекты веб-разработки"
            },
            "position": {
                "x": 200,
                "y": 100
             }
        },
        {
            "id": "7",
            "type": "dictionaryNode",
            "data": {
                "title": "Роутер",
                "description": "Компонент, который позволяет управлять навигацией веб-приложения. Он обеспечивает сопоставление URL-адресов с определенными компонентами, что позволяет приложению динамически изменять отображаемый контент в зависимости от текущего URL."
            },
            "position": {
                "x": 100,
                "y": 300
             }
        },
        {
            "id": "8",
            "type": "dictionaryNode",
            "data": {
                "title": "DevTools",
                "description": "Набор инструментов для разработчиков, предназначенный для анализа, отладки и оптимизации веб-сайтов или веб-приложений. DevTools позволяют разработчикам просматривать и изменять HTML, CSS и JavaScript код, а также производить профилирование производительности, отслеживать сетевой трафик, анализировать использование памяти и многое другое."
            },
            "position": {
                "x": 0,
                "y": 140
            }
        },
        {
            "id": "9",
            "type": "dictionaryNode",
            "data": {
                "title": "Change detection",
                "description": "Процесс, используемый во многих фронтенд-фреймворках, таких как Angular, React и Vue.js, для отслеживания изменений в данных или состоянии приложения и автоматического обновления пользовательского интерфейса в соответствии с этими изменениями."
            },
            "position": {
                "x": 0,
                "y": 250
             }
        },
        {
            "id": "10",
            "type": "dictionaryNode",
            "data": {
                "title": "Методы жизненного цикла",
                "description": "Cпециальные функции, предоставляемым фреймворками или библиотеками, которые позволяют разработчикам определять поведение компонентов или объектов на различных этапах их жизненного цикла."
            },
            "position": {
                "x": -200,
                "y": 300
             }
        },
        {
            "id": "11",
            "type": "dictionaryNode",
            "data": {
                "title": "Browser API",
                "description": "Hабор программных интерфейсов, предоставляемых веб-браузером для взаимодействия с веб-страницами или веб-приложениями. Эти интерфейсы предоставляют доступ к различным функциям браузера, таким как работа с DOM (Document Object Model), управление историей браузера, доступ к геолокации устройства, управление куки, асинхронные запросы к серверу (AJAX), мультимедийные возможности и другие возможности."
            },
            "position": {
                "x": -200,
                "y": 200
             }
        },
        {
            "id": "12",
            "type": "dictionaryNode",
            "data": {
                "title": "URL",
                "description": "Cтрока, однозначно определяющая, где в интернете находится ресурс. В контексте HTTP, URL называют \"адрес\" (web address)\" или \"ссылку\" (link)."
            },
            "position": {
                "x": 50,
                "y": 400
             }
        }
    ],
    "edges": [
        {
            "id": "1-2",
            "source": "1",
            "target": "2",
            "label": "содержит 1 или несколько"
        },
        {
            "id": "4-3",
            "source": "4",
            "target": "3",
            "label": "обновляет/изменяет"
        },
        {
            "id": "6-9",
            "source": "6",
            "target": "9",
            "label": "использует механизм"
        },
        {
            "id": "5-10",
            "source": "5",
            "target": "10",
            "label": "предоставляет"
        },
        {
            "id": "2-11",
            "source": "2",
            "target": "11",
            "label": "имеет доступ к"
        },
        {
            "id": "1-8",
            "source": "1",
            "target": "8",
            "label": "отлаживается с помощью"
        },
        {
            "id": "1-5",
            "source": "2",
            "target": "5",
            "label": "состоит из"
        },
        {
            "id": "6-5",
            "source": "6",
            "target": "5",
            "label": "управляет"
        },
        {
            "id": "6-7",
            "source": "6",
            "target": "7",
            "label": "содержит"
        },
        {
            "id": "6-4",
            "source": "6",
            "target": "4",
            "label": "осуществляет"
        },
        {
            "id": "1-6",
            "source": "1",
            "target": "6",
            "label": "создано на основе"
        },
        {
            "id": "7-12",
            "source": "7",
            "target": "12",
            "label": "взаимодействует с"
        }
    ]
}